title: more eggs backdoor
status: experimental
description: Detects more eggs backdoor execution from AppData directory or unexpected file extensions
references:
    - https://securityintelligence.com/posts/more_eggs-anyone-threat-actor-itg08-strikes-again/
    - https://redcanary.com/blog/detecting-msxsl-attacks/
    - https://medium.com/@threathuntingteam/msxsl-exe-and-wmic-exe-a-way-to-proxy-code-execution-8d524f642b75
tags:
    - attack.execution
    - attack.t1220
author: johncypher
date: 2022/01/19
modified: 
logsource:
    product: windows
    category: process_creation
detection:
    selection1:
        - CommandLine|contains|all:
            - '\AppData\'
            - 'ie4uinit.exe'
    selection2:
        - CommandLine|contains|all:
            - '\AppData\'
            - 'msxsl.exe'
    selection3:
        - CommandLine|contains|all:
            - 'msxsl.exe'
            - '.txt'
            - '.txt'
    condition: selection1 or selection2 or selection3
falsepositives:
    - Unknown
level: high
